import '../agreement/Agreement.css'
import Header from '../../widgets/header/Header';
import '@/shared/styles/AdaptiveStyles.css'
import Navigatorr from '../../widgets/navigator/Navigatorr';

const Consent = () => {

    return (
    <><Header/>
        <div className="agreement">
            
                <main className="agreement-content">
                    <div className="container">
                        <h1>Согласие Пользователя на обработку персональных данных</h1>
                        <div >

                        <p>В соответствии со статьями 23, 24 Конституции Российской Федерации, Федеральным законом от 27.07.2006 № 152-ФЗ «О персональных данных», Политикой в отношении обработки персональных данных, размещенной на сайте https://nyuroprint.ru по адресу: <a href="https://nyuroprint.ru/privacy">https://nyuroprint.ru/privacy</a> (далее - Политика обработки ПДн),</p>

                        <p>Я, субъект персональных данных, именуемый в дальнейшем Пользователь, отправляя информацию через формы обратной связи (далее, каждая из них и все в совокупности - Форма, Формы) при прохождении процедуры регистрации в целях использования сайта https://nyuroprint.ru и его сервисов (далее - Сайт, Сервис), и в дальнейшем при использовании Сайта и/или его Сервисов, выражаю полное, безоговорочное и однозначное Согласие на обработку моих персональных данных (далее - Согласие) на следующих условиях:</p>

                        <h2>1. Оператор</h2>
                        <p>Согласие выдано Столбовому Егору Васильевичу (далее - Оператор).</p>

                        <h2>2. Перечень персональных данных</h2>
                        <p>Согласие выдано на обработку персональных и иных данных, указанных Пользователем в Формах путем заполнения соответствующих текстовых полей и/или прикрепленных к Формам файлов, а именно следующих категорий:</p>
                        <ul>
                            <li>фамилия, имя, отчество, адрес электронной почты (e-mail), номер телефона, другая аналогичная информация, сообщённая о себе Пользователем Сайта, на основании которой возможна его идентификация как субъекта персональных данных;</li>
                            <li>фотографии;</li>
                            <li>данные, которые автоматически передаются в процессе просмотра и при посещении страниц Сайта: IP адрес, информация из cookies, информация о браузере, время доступа, адрес посещаемой страницы, реферер (адрес предыдущей страницы);</li>
                            <li>электронные данные (HTTP-заголовки, IP-адрес, файлы cookie, веб-маяки/пиксельные теги, данные об идентификаторе браузера, информация об аппаратном и программном обеспечении, данные сети wi-fi).</li>
                        </ul>

                        <h2>3. Цели обработки</h2>
                        <p>Согласие выдано на обработку персональных данных в целях:</p>
                        <ul>
                            <li>информирования Пользователя посредством отправки электронных писем;</li>
                            <li>дообучения нейронной сети по распознаванию дефектов;</li>
                            <li>заключения договоров, осуществления взаиморасчетов;</li>
                            <li>сбора Оператором статистики;</li>
                            <li>улучшения качества работы Сайта и/или его Сервиса, удобства их использования и разработки новых сервисов и услуг.</li>
                        </ul>

                        <h2>4. Способ обработки</h2>
                        <p>Согласие выдано на обработку персональных данных смешанным (автоматизированным и неавтоматизированным) способом.</p>

                        <p>В процессе обработки персональных данных Оператор вправе осуществлять: сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных Пользователя.</p>

                        <h2>5. Подтверждения Пользователя</h2>
                        <p>Настоящим, Пользователь подтверждает, что:</p>
                        <p>5.1. Ознакомлен и согласен с тем, что передача персональных данных Пользователя может осуществляться Оператором в объеме, необходимом для получения Пользователем доступа к Сайту, его Содержанию и/или его Сервису.</p>
                        <p>5.2. Дает согласие на обработку своих персональных данных, указанных в пункте 2 настоящего согласия, лицам, указанным в пункте 1 настоящего согласия.</p>
                        <p>5.3. Проинформирован о возможности отзыва согласия на основании положений Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных» путем личного обращения или направления письменного обращения (в том числе в форме электронного документа, подписанного простой электронной подписью или усиленной квалифицированной электронной подписью), на имя лиц, указанных в пункте 1 Согласия.</p>
                        <p>5.4. Проинформирован, что лица, указанные в пункте 1 настоящего Согласия, вправе продолжать обработку персональных данных Пользователя после получения отзыва Согласия, а равно после истечения срока действия Согласия, при наличии оснований, предусмотренных частью 2 статьи 9 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных».</p>

                        <h2>6. Отзыв согласия</h2>
                        <p>Согласие вступает в силу с момента его отправки и может быть отозвано Пользователем путем направления письменного заявления в произвольной форме в адрес Оператора по адресу электронной почты nyuroprint@yandex.ru либо иным способом, позволяющим однозначно определить факт его получения адресатом.</p>

                        <h2>7. Срок действия согласия</h2>
                        <p>Согласие действует в течение неопределенного срока до момента его отзыва Пользователем. Согласие прекращает свое действие с даты, указанной в заявлении Пользователя об отзыве Согласия на обработку ПДн, но не ранее даты, следующей за датой фактического получения Оператором отзыва Согласия.</p>

                        <h2>8. Момент предоставления согласия</h2>
                        <p>Датой и временем формирования, подтверждения и отправки Согласия прошу считать момент маркировки соответствующего поля (либо нажатия на соответствующую кнопку) в Форме и/или нажатие на кнопку отправки Формы на любой странице Сайта и/или его Сервиса.</p>

                        <h2>9. Способ предоставления согласия</h2>
                        <p>Руководствуясь ч. 4 ст. 9 Федерального закона от 27.07.2006 № 152-ФЗ «О персональных данных», направляю через личное мобильное устройство или персональный компьютер путем прикрепления к специальной форме или при заполнении соответствующих полей такой формы при прохождении процедуры регистрации на Сайте свои персональные данные.</p>

                        <h2>10. Ответственность Оператора</h2>
                        <p>Пользователь проинформирован, что ответственность перед ним за действия лица, обрабатывающего его персональные данные по поручению Оператора, несет Оператор, выдавший соответствующее поручение (согласие).</p>
                        </div>
                    </div>
                    
                </main>
        </div><Navigatorr/>
    </>
    );
};

export default Consent;